endcustomer-exp-api/src/test/resources/scaffolder/request/endCustomerRequestCustomerAndExternalIds.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.cloudhub.io/schemas/class/InchcapeEndCustomerInterface_v1">
   <soapenv:Header/>
   <soapenv:Body>
      <inc:sendEndCustomer>
         <inc:customer>
            <inc:BusinessId>Trivett Australia</inc:BusinessId>
            <inc:ExternalId>Mani12345</inc:ExternalId>
            <inc:SourceSystem>VMS</inc:SourceSystem>
            <inc:ExternalCustomerId>Mani1234</inc:ExternalCustomerId>
            <inc:RecordType>Individual</inc:RecordType>
            <inc:Salutation>Mr</inc:Salutation>
            <inc:Gender>male</inc:Gender>
            <inc:FirstName>Jason</inc:FirstName>
            <inc:LastName>Bourne</inc:LastName>
            <inc:CompanyName>CIA</inc:CompanyName>
            <inc:BirthDate>1981-01-01</inc:BirthDate>
            <inc:ContactSalutation>Mr.</inc:ContactSalutation>
            <inc:ContactFirstName>Jason</inc:ContactFirstName>
            <inc:ContactLastName>Bourne</inc:ContactLastName>
            <inc:ContactBirthDate>1981-01-01</inc:ContactBirthDate>
            <inc:EmailAddress>json-burn@gmail.com</inc:EmailAddress>
            <inc:EmailAddressValid>true</inc:EmailAddressValid>
            <inc:EmailAddressValidatedBy>DataTools</inc:EmailAddressValidatedBy>
            <inc:StandardAddressStreet>12 Harper St.</inc:StandardAddressStreet>
            <inc:StandardAddressCity>London</inc:StandardAddressCity>
            <inc:StandardAddressPostcode>12H L82</inc:StandardAddressPostcode>
            <inc:StandardAddressState></inc:StandardAddressState>
            <inc:StandardAddressCountry></inc:StandardAddressCountry>
            <inc:StandardAddressDPID>129sakd3a01</inc:StandardAddressDPID>
            <inc:StandardAddressRTS>false</inc:StandardAddressRTS>
            <inc:StandardAddressValid>true</inc:StandardAddressValid>
            <inc:StandardAddressValidatedBy>DataTools</inc:StandardAddressValidatedBy>
            <inc:MailingAddressStreet>12 Harper St.</inc:MailingAddressStreet>
            <inc:MailingAddressCity>London</inc:MailingAddressCity>
            <inc:MailingAddressState></inc:MailingAddressState>
            <inc:MailingAddressCountry></inc:MailingAddressCountry>
            <inc:MailingAddressPostcode>12H L82</inc:MailingAddressPostcode>
            <inc:MailingAddressDPID>129sakd3a01</inc:MailingAddressDPID>
            <inc:MailingAddressValid>true</inc:MailingAddressValid>
            <inc:MailingAddressValidatedBy>DataTools</inc:MailingAddressValidatedBy>
            <inc:MailingAddressRTS>false</inc:MailingAddressRTS>
            <inc:HomePhone></inc:HomePhone>
            <inc:HomePhoneValid>false</inc:HomePhoneValid>
            <inc:HomePhoneValidatedBy></inc:HomePhoneValidatedBy>
            <inc:WorkPhone></inc:WorkPhone>
            <inc:WorkPhoneValid>false</inc:WorkPhoneValid>
            <inc:WorkPhoneValidatedBy></inc:WorkPhoneValidatedBy>
            <inc:MobilePhone></inc:MobilePhone>
            <inc:MobilePhoneValid>false</inc:MobilePhoneValid>
            <inc:MobilePhoneValidatedBy></inc:MobilePhoneValidatedBy>
            <inc:BusinessPhone></inc:BusinessPhone>
            <inc:BusinessPhoneValid>false</inc:BusinessPhoneValid>
            <inc:BusinessPhoneValidatedBy></inc:BusinessPhoneValidatedBy>
         </inc:customer>
         
         <inc:externalIds>
            <inc:ExternalId>Mani12345</inc:ExternalId>
            <inc:ExternalEntityId>434y</inc:ExternalEntityId>
            <inc:SourceSystem>VMS</inc:SourceSystem>
           <inc:BusinessId>Trivett Australia</inc:BusinessId>
         </inc:externalIds>
      </inc:sendEndCustomer>
   </soapenv:Body>
</soapenv:Envelope>